{"WorkExperience":[{"job":"Modern Tribe Agency","title":"WordPress Developer, Frontend (contract)","time":"November 2024 - present","duties":["Building frontends, editor interfaces, and design systems in Next.js apps and WordPress block themes, including theme.json, custom block work, and plugin configuration","Translating Figma designs into semantic, maintainable UI components","Integrated and customized plugins on client sites including FacetWP, Gravity Forms and Smash Balloon","Planning and implementing accessibility and responsiveness improvements for legacy sites"]},{"job":"Self-employed","title":"Freelance Data Visualization Engineer/Designer","time":"Jan 2020 - May 2021; July 2024 - present","duties":["Collaborated with the Lenfest Institute and INN to create data dashboard and accompanying analysis for state-level news publisher business metrics","Gathered and cleaned data, developed charts and bespoke UI, and wrote copy for a visual essay about NBA uniforms for the Pudding","Turned an illustration of the standard model of particle physics into a React-based interactive for Science News","Visualized federal funding data through charts and maps for the Journalist's Resource","Designed a matchday printed handout for fans for the New England Revolution, using D3.js to visualize game history"]},{"job":"Alley","title":"User Experience Developer II","time":"March 2021 - July 2024","duties":["Shipped frontend and editor-side Web Components and React features for enterprise Next.js web apps and WordPress sites, ensuring accessibility, internationalization, and maintainability","Prototyped and built static and interactive chart designs for dataviz projects, using Figma and JavaScript libraries","Led accessibility audits to improve screen reader support, color contrast, and keyboard navigation","Owned the development process on certain features, including backlog refinement, epic scoping and planning, and client-facing demos","Led backlog refinement, epic planning, and client demos on a per-feature basis"]},{"job":"Northeastern University","title":"Frontend and Data Developer","time":"April 2019 - March 2021","duties":["Designed and developed interactive maps and graphics using custom Svelte/D3 rig, to connect faculty research and data tools to the wider public","Designed, built and updated the university’s public-facing COVID-19 testing dashboard","Authored dataviz style guide combining best-practice information design with brand standards","Developed and deployed microsites for university initiatives and collaborations","Maintained and added features to department WordPress site, using Timber/Twig templates"]},{"job":"Institute for Nonprofit News","title":"Frontend Developer/Designer","time":"February 2018 - April 2019","duties":["Worked with a small, remote scrum team providing agency services to nonprofit media outlets","Designed, built, and supported WordPress websites and open-source plugins","Created UI wireframes, prototypes, style tiles and design systems for client projects","Updated internal branding guidelines and assets, for both print and digital uses"]},{"job":"Harvard Business Review","title":"Editorial Developer","time":"March 2014 - January 2018","duties":["Designed and built web-native tools and data visualizations based on new and archive content","Iterated and implemented new processes to bridge design, tech and editorial desks","Built and maintained Node-based Slack chatbots, both internal- and external-facing"]},{"job":"Seven Days","title":"Digital Media Manager (prev. Deputy Web Editor)","time":"June 2010 - March 2014","duties":["Created Bootstrap-based WordPress themes for Kids VT, Vermont Tech Jam and Restaurant Week sites","Managed migration projects, redesigns and daily production of six email newsletters","Directed election coverage on social media, live blogs, chats and results dashboards","Contributed multimedia elements, charts and blog posts to editorial products"]}],"Talks":[{"title":"First SvelteKit Data App","event":"NICAR","date":"March 2025","content":"I lead a hands-on session to help data journalists build data-driven, dynamic, easily deployable apps using SvelteKit."},{"title":"Building a Culture of Accessibility and UX in Your Organization","event":"SRCCON","date":"August 2024","content":"I facilitated a group discussion of about twenty news website editors on the common obstacles they face in getting user-centered, accessible experiences to be prioritized in under-resourced newsrooms."},{"title":"Boosting Careers Without the Ladder","event":"SRCCON:WORK","date":"December 2017","content":"I co-facilitated a working session on how early- and mid-career journalists could advance their careers in organizations where the traditional career growth path may not know how to value technical or product-oriented skills."},{"title":"A Data Analysis of My Drinking Habits","event":"SRCCON","date":"July 2016","content":"I gave a lightning talk about what I learned by loading my data from the beer-rating app Untappd into RStudio for a graduate-level statistics course."},{"title":"Advancing with Visual Analytics: Key (Free) Programs to Dissect Your Data","event":"Storytelling With Data (Boston University)","date":"June 2016","content":"I presented a crash course to a professional workshop on free software to manage, analyze and visualize data, with examples that included Plotly, Infogram, and DocumentCloud."},{"title":"Responsive Design and Dataviz","event":"CASCADE BOS","date":"April 2016","content":"For a meetup of frontend professionals, I presented examples of web-based data visualizations that tackled desktop-to-mobile screen-size differences in creative ways, both from my own work and the wider realm of visual data journalism."},{"title":"Big Ambition, Small Staff: How the F*** Do I Prioritize?","event":"SRCCON","date":"June 2015","content":"I co-facilitated a session to journalism technology professionals and students on how to efficiently, ambitiously do the work in newsrooms when your tech team is small (or only you)."}],"VolunteerPositions":[{"position":"Marketing Committee & Board Member","org":"Boston ISA","date":"2024-2025","content":"I helped to start up the independent supporters’ group for the new women’s professional soccer team coming to Boston in 2026. I designed the group’s inaugural logo and branding package for founding members, and advised on the website build."},{"position":"At-Large Board of Directors Member","org":"Midnight Riders ISG","date":"2025","content":"I joined up with the original independent supporters’ group for New England’s Major League Soccer team, designing a tifo display, print materials, and two supporters’ scarves for the 2025 season."},{"position":"Mentor","org":"Data Visualization Society","date":"2024-2025","content":"Met weekly with early-career data visualization professionals, advising them on both the technical side (D3/Svelte tutorials) and the business side (job-seeking advice) of the dataviz industry and offering critique for ongoing projects."}]}